# Study Of SQL

This study is based on the article with 50 questions to query a database.
With this study notebook I will be crerating the database, creating the tables and then I will start with passing through each of the questions and getting answers for easier visualization I will be utilizing pandas too.

article : https://www.techbeamers.com/sql-query-questions-answers-for-practice/

### Connecting with Localhost
maybe later I can play with getting a container made for it but for now I will be using a local server.

In [50]:
from sqlalchemy import *
from connction_db import *

# make the connection and add the database if necessary
engine = engine_connect_db()

##### Checking if the process worked by using pandas to present the tables.

In [52]:
import pandas as pd

In [53]:
def run_qr(query):
    df = pd.read_sql(query, engine.connect())
    display(df)
    
run_qr('show tables;')
run_qr('SELECT * FROM Worker;')

  Tables_in_linux_test
0                Bonus
1                Title
2               Worker

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
4          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
5          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
6          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
7          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

Q-1. Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as <WORKER_NAME>.

In [54]:
run_qr('SELECT FIRST_NAME AS name FROM Worker;')

       name
0    Monika
1  Niharika
2    Vishal
3   Amitabh
4     Vivek
5     Vipul
6    Satish
7   Geetika

Q-2. Write an SQL query to fetch “FIRST_NAME” from Worker table in upper case.

In [55]:
run_qr('SELECT UPPER(FIRST_NAME) AS name FROM Worker;')

       name
0    MONIKA
1  NIHARIKA
2    VISHAL
3   AMITABH
4     VIVEK
5     VIPUL
6    SATISH
7   GEETIKA

Q-3. Write an SQL query to fetch unique values of DEPARTMENT from Worker table.
Ans.

In [56]:
run_qr('SELECT DEPARTMENT FROM Worker GROUP BY DEPARTMENT;') # My first option

  DEPARTMENT
0         HR
1      Admin
2    Account

In [9]:
run_qr('SELECT distinct DEPARTMENT FROM Worker;') # from the answer sheet, ssems like a good idea to use a distinct

  DEPARTMENT
0         HR
1      Admin
2    Account

Q-4. Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

In [10]:
run_qr('SELECT LEFT(FIRST_NAME,3) FROM Worker;') #My answer

  LEFT(FIRST_NAME,3)
0                Mon
1                Nih
2                Vis
3                Ami
4                Viv
5                Vip
6                Sat
7                Gee

In [11]:
run_qr('Select substring(FIRST_NAME,1,3) from Worker;') # answer sheet using substring

  substring(FIRST_NAME,1,3)
0                       Mon
1                       Nih
2                       Vis
3                       Ami
4                       Viv
5                       Vip
6                       Sat
7                       Gee

Q-5. Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [12]:
run_qr(';') # didn't get the question

OperationalError: (pymysql.err.OperationalError) (1065, 'Query was empty')
[SQL: ;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

Q-6. Write an SQL query to print the FIRST_NAME from Worker table after removing white spaces from the right side.

In [13]:
run_qr('SELECT RTRIM(FIRST_NAME) FROM Worker;')

  RTRIM(FIRST_NAME)
0            Monika
1          Niharika
2            Vishal
3           Amitabh
4             Vivek
5             Vipul
6            Satish
7           Geetika

Q-7. Write an SQL query to print the DEPARTMENT from Worker table after removing white spaces from the left side.

In [14]:
run_qr('SELECT LTRIM(DEPARTMENT) FROM Worker;')

  LTRIM(DEPARTMENT)
0                HR
1             Admin
2                HR
3             Admin
4             Admin
5           Account
6           Account
7             Admin

Q-8. Write an SQL query that fetches the unique values of DEPARTMENT from Worker table and prints its length.

In [15]:
run_qr('SELECT LENGTH(DEPARTMENT) FROM Worker GROUP BY DEPARTMENT;') # The answer sheet again utilyzed the distinct function

   LENGTH(DEPARTMENT)
0                   2
1                   5
2                   7

Q-9. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.

In [16]:
run_qr('SELECT REPLACE(FIRST_NAME,"a","A") FROM Worker;')

  REPLACE(FIRST_NAME,"a","A")
0                      MonikA
1                    NihArikA
2                      VishAl
3                     AmitAbh
4                       Vivek
5                       Vipul
6                      SAtish
7                     GeetikA

Q-10. Write an SQL query to print the FIRST_NAME and LAST_NAME from Worker table into a single column COMPLETE_NAME. A space char should separate them.

In [17]:
run_qr('SELECT concat(FIRST_NAME, " ", LAST_NAME) AS COMPLETE_NAME FROM Worker;')

     COMPLETE_NAME
0     Monika Arora
1   Niharika Verma
2   Vishal Singhal
3    Amitabh Singh
4      Vivek Bhati
5      Vipul Diwan
6     Satish Kumar
7  Geetika Chauhan

Q-11. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending.

In [18]:
run_qr('SELECT * FROM Worker ORDER BY FIRST_NAME;')

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
1          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin
2          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
3          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
4          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
5          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
6          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
7          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin

Q-12. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

In [19]:
run_qr('SELECT * FROM Worker ORDER BY FIRST_NAME ASC, DEPARTMENT DESC;')

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
1          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin
2          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
3          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
4          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
5          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
6          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
7          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin


Q-13. Write an SQL query to print details for Workers with the first name as “Vipul” and “Satish” from Worker table.

In [20]:
run_qr('SELECT * FROM Worker WHERE FIRST_NAME IN ("Vipul", "Satish") ;')

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
1          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account


Q-14. Write an SQL query to print details of workers excluding first names, “Vipul” and “Satish” from Worker table.

In [21]:
run_qr('SELECT WORKER_ID, LAST_NAME, SALARY, JOINING_DATE, DEPARTMENT FROM Worker WHERE FIRST_NAME IN ("Vipul", "Satish");')
# my answer, misunderstood the question

   WORKER_ID LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          6     Diwan  200000 2014-06-11 09:00:00    Account
1          7     Kumar   75000 2014-01-20 09:00:00    Account

In [22]:
run_qr('SELECT * FROM Worker WHERE FIRST_NAME NOT IN ("Vipul", "Satish");')
#answer sheet, we are suppose to exclude the 2 names out of the rst of the list

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
4          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
5          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin


Q-15. Write an SQL query to print details of Workers with DEPARTMENT name as “Admin”.

In [23]:
run_qr('SELECT * FROM Worker WHERE DEPARTMENT="Admin";')

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
1          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
2          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
3          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

Q-16. Write an SQL query to print details of the Workers whose FIRST_NAME contains ‘a’.

In [24]:
#run_qr("SELECT * FROM Worker WHERE FIRST_NAME LIKE '%a%';")
#works at mysql terminal
# presents an error: not enogh arguments for format string
# i believe the problem comes because of the %into the lines that need to function but not as an operator


Q-17. Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘a’.

In [25]:
#run_qr('SELECT * FROM Worker WHERE FIRST_NAME LIKE "%a";')
# WORKS ON TERMINAL

Q-18. Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘h’ and contains six alphabets.

In [26]:
#run_qr('SELECT * FROM Worker WHERE FIRST_NAME LIKE "_____h";')
#Works on terminal

 

Q-19. Write an SQL query to print details of the Workers whose SALARY lies between 100000 and 500000.

In [27]:
run_qr('SELECT * FROM Worker WHERE SALARY BETWEEN 100000 AND 500000;')

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
2          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
3          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
4          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account

Q-20. Write an SQL query to print details of the Workers who have joined in Feb’2014.

In [28]:
#works at the terminal
#run_qr('SELECT * FROM Worker WHERE DATE_FORMAT(JOINING_DATE, "%Y,%M") = "2014,February";')

Q-21. Write an SQL query to fetch the count of employees working in the department ‘Admin’.

In [29]:
run_qr('SELECT COUNT(*) AS total_admin FROM Worker WHERE DEPARTMENT = "Admin";')

   total_admin
0            4

Q-22. Write an SQL query to fetch worker names with salaries >= 50000 and <= 100000.

In [30]:
run_qr('SELECT CONCAT(FIRST_NAME, " ", LAST_NAME) As Worker_Name FROM Worker WHERE SALARY BETWEEN 50000 AND 100000;')

       Worker_Name
0     Monika Arora
1   Niharika Verma
2     Satish Kumar
3  Geetika Chauhan

Q-23. Write an SQL query to fetch the no. of workers for each department in the descending order.

In [31]:
run_qr('SELECT DEPARTMENT, COUNT(DEPARTMENT) AS workers_by_department FROM Worker GROUP BY DEPARTMENT ORDER BY workers_by_department;')

  DEPARTMENT  workers_by_department
0         HR                      2
1    Account                      2
2      Admin                      4

Q-24. Write an SQL query to print details of the Workers who are also Managers.

In [32]:
run_qr(''' SELECT *
            FROM Worker W
            JOIN Title T
            ON W.WORKER_ID=T.WORKER_REF_ID
            WHERE WORKER_TITLE = "Manager";
''')

,WORKER_ID,FIRST_NAME,LAST_NAME,SALARY,JOINING_DATE,DEPARTMENT,WORKER_REF_ID,WORKER_TITLE,AFFECTED_FROM
0,1,Monika,Arora,100000,2014-02-20 09:00:00,HR,1,Manager,2016-02-20
1,5,Vivek,Bhati,500000,2014-06-11 09:00:00,Admin,5,Manager,2016-06-11


Q-25. Write an SQL query to fetch duplicate records having matching data in some fields of a table.

In [33]:
run_qr('''SELECT JOINING_DATE, DEPARTMENT, COUNT(*) AS n_duplicates 
            FROM Worker 
            GROUP BY JOINING_DATE, DEPARTMENT 
            HAVING n_duplicates > 1 ;''')
# This process was a bit more complicated:
#   1- Select the field that would be taken in consideration
#   2- Make the Grouping
#   3- Add the counter
#   4- Making sure that only the ones that actually have duplicates show up

         JOINING_DATE DEPARTMENT  n_duplicates
0 2014-02-20 09:00:00         HR             2
1 2014-06-11 09:00:00      Admin             2

Q-26. Write an SQL query to show only odd rows from a table.

In [34]:
run_qr('SELECT * FROM Worker WHERE MOD(WORKER_ID, 2) = 1 ;')

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
2          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
3          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account

Q-27. Write an SQL query to show only even rows from a table.

In [35]:
run_qr('SELECT * FROM Worker WHERE MOD(WORKER_ID, 2) = 0 ;')

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
1          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
2          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
3          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

Q-28. Write an SQL query to clone a new table from another table.

In [36]:
# my solution
# First creating a table alike the first
engine.execute('CREATE TABLE bonus_tab_2 LIKE Bonus;')
# Inserting data into new table
engine.execute('INSERT INTO bonus_tab_2 SELECT * FROM Bonus;')
run_qr('SELECT * FROM bonus_tab_2;')

   WORKER_REF_ID  BONUS_AMOUNT BONUS_DATE
0              1          5000 2016-02-20
1              2          3000 2016-06-11
2              3          4000 2016-02-20
3              1          4500 2016-02-20
4              2          3500 2016-06-11

In [37]:
# Answer sheet solution
#engine.execute('SELECT * INTO WorkerClone FROM Worker;')
# I prefered mine

Q-29. Write an SQL query to fetch intersecting records of two tables.

In [38]:
run_qr('''(SELECT *
        FROM Bonus)
        INTERSECT
        (SELECT *
        FROM bonus_tab_2);''')

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'INTERSECT\n        (SELECT *\n        FROM bonus_tab_2)' at line 3")
[SQL: (SELECT *
        FROM Bonus)
        INTERSECT
        (SELECT *
        FROM bonus_tab_2);]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [39]:
# Answer sheet
print('''(SELECT * FROM Worker)
INTERSECT
(SELECT * FROM WorkerClone);''')
#still need to figure it out

(SELECT * FROM Worker)
INTERSECT
(SELECT * FROM WorkerClone);

Q-30. Write an SQL query to show records from one table that another table does not have.

In [40]:
run_qr(';')

OperationalError: (pymysql.err.OperationalError) (1065, 'Query was empty')
[SQL: ;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

Q-31. Write an SQL query to show the current date and time.

In [ ]:
run_qr(';')

Q-32. Write an SQL query to show the top n (say 10) records of a table.

In [ ]:
run_qr(';')


Q-33. Write an SQL query to determine the nth (say n=5) highest salary from a table.

In [ ]:
run_qr(';')


Q-34. Write an SQL query to determine the 5th highest salary without using TOP or limit method.

In [ ]:
run_qr(';')

Q-35. Write an SQL query to fetch the list of employees with the same salary.

In [ ]:
run_qr(';')

Q-36. Write an SQL query to show the second highest salary from a table.

In [ ]:
run_qr(';')

Q-37. Write an SQL query to show one row twice in results from a table.

In [ ]:
run_qr(';')

Q-38. Write an SQL query to fetch intersecting records of two tables.

In [ ]:
run_qr(';')


Q-39. Write an SQL query to fetch the first 50% records from a table.

In [ ]:
run_qr(';')

Q-40. Write an SQL query to fetch the departments that have less than five people in it.

In [ ]:
run_qr(';')


Q-41. Write an SQL query to show all departments along with the number of people in there.

In [ ]:
run_qr(';')

Q-42. Write an SQL query to show the last record from a table.

In [ ]:
run_qr(';')

Q-43. Write an SQL query to fetch the first row of a table.

In [ ]:
run_qr(';')

Q-44. Write an SQL query to fetch the last five records from a table.

In [ ]:
run_qr(';')

Q-45. Write an SQL query to print the name of employees having the highest salary in each department.

In [ ]:
run_qr(';')

Q-46. Write an SQL query to fetch three max salaries from a table.

In [ ]:
run_qr(';')

Q-47. Write an SQL query to fetch three min salaries from a table.

In [ ]:
run_qr(';')


Q-48. Write an SQL query to fetch nth max salaries from a table.

In [ ]:
run_qr(';')


Q-49. Write an SQL query to fetch departments along with the total salaries paid for each of them.

In [ ]:
run_qr(';')

Q-50. Write an SQL query to fetch the names of workers who earn the highest salary.

In [ ]:
run_qr(';')

In [49]:
engine.execute(f'DROP DATABASE {mysql_db_config["database"]}')